#Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые 
# встречаются в обоих наборах. Пользователь вводит 2 числа. 
# n - кол-во элементов первого множества. m - кол-во элементов второго 
# множества. Затем пользователь вводит сами элементы множеств.

import random
n = int(input('Введите количество элементов первого множества\n'))
m = int(input('Введите количество элементов второго множества\n'))
list_1 = [random.randint(0, 10) for i in range(n)]
list_2 = [random.randint(0, 10) for i in range(m)]
print(f'Первое множество: {list_1}\n')
print(f'Второе множество: {list_2}\n')

set_result = set()
for i in range(n):
    for j in range(m):
        if i in list_1 and i in list_2 :
            set_result.add(i)
print("Числа, которые встречаются в обоих наборах: ", *sorted(set_result))