#В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растет на круглой грядке, причем кусты высажены только 
# по окружности. Таким образом, у каждого куста есть ровно два соседних. 
# Всего на грядке растет N кустов. Эти кусты обладают разной 
# урожайностью, поэтому ко времени сбора на них выросло различное число 
# ягод – на i-ом кусте выросло ai ягод. В этом фермерском хозяйстве 
# внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих 
# модулей. Собирающий модуль за один заход, находясь непосредственно 
# перед некоторым кустом, собирает ягоды с этого куста и с двух 
# соседних с ним. Напишите программу для нахождения максимального 
# числа ягод, которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.

n = int(input('Введите число кустов\n'))
list_res = []
for i in range (1, n+1) :
    list_res.append(i)
    i += 1
print(*list_res)

count = 0
for i in range(n-1) :
    if list_res[i-1] + list_res[i] +list_res[i+1] > count :
        count = list_res[i-1] + list_res[i] +list_res[i+1]
if len(list_res) <= 2 :
    count = sum(list_res)
print(f'Максимальное количество ягод за один заход: {count}')

